#@StaticMethod - используется для создания метода,
# который ничего не знает о классе или экземпляре,
# через который он был вызван.
# Он просто получает переданные аргументы, без неявного первого аргумента,
# и его определение неизменяемо через наследование.

class Person():
    @staticmethod
    def is_adult(age):
        if age > 18:
            return True
        else:
            return False

print(Person.is_adult(23))
#Статический метод помогает в достижении инкапсуляции в классе
#В примере мы проверяем является ли человек взрослым без создания экземпялра