from pizza import make_pizza as mp #Используем короткий уникальный псевдоним(alias)
#В процессе обработки этого файла, Python получает указание открыть файл pizza.py и
#скопировать все функции из него в программу

#Модуль - отдельный файл, содержаший функцию/функции.

#Любая функция определенная в pizza.py будет досупна в making_pizzas.py
mp(20, 'pepperoni')
mp(22, 'mushrooms', 'green peppers', 'extra cheese')

"""Назначение псевдонима для модуля"""
import pizza as p

p.make_pizza(20, 'margarita')



"""Импортирование всех функций модуля"""
#Использование звездочки в коде оператора import, дает указкание Python скопировать
#каждую функцию из модуля pizza в файл программы. После импортирования всех функций
#появляется возможность вызывать каждую функцию по имени, не использую точечную нотацию.
from pizza import *

make_pizza(26, 'pepperoni')
make_pizza(22, 'mushrooms', 'green peppers', 'extra cheese')