import math
from sympy import init_session


init_session()
# Назначение тригонометрических функций для сокращения записи математических выражений
c = math.cos
s = math.sin


def gen_Matrix(a, x, y):
    """
    Функция формирования матрицы однородных преобразований (поворот и сдвиг).
    При маневрировании по часовой стрелке аргумент 'a' принимает отрицательное значение.
    """
    return Matrix([
        [c(a), -s(a), x],
        [s(a), c(a), y],
        [0, 0, 1]
    ])

# Исходные геометрические и кинематические параметры траектории
R = 8
a1 = math.radians(90) # начальный поворот вниз
a = math.radians(30) # шаг поворота(угол колес)
l = 4 # длины отрезков линейного пути
T = math.sqrt(2*(R**2)*(1-c(a))) #хорды по дуге


# Привязка локальной системы координат (оси вращаются совместно со связанным базисом платформы)
Start = gen_Matrix(0, 0, 0) #стартовая позиция

# Расчет матриц элементарных пространственных преобразований первого этапа
M_r1 = gen_Matrix(-a1, 0, 0) #поворот вниз
SdvigL1 = gen_Matrix(0, l, 0) #движение по l1 до поворота

# Расчет параметров движения на первом криволинейном участке (первый поворот платформы)
M_r2 = gen_Matrix(-a, 0, 0)
Sdvig2 = gen_Matrix(0, T, 0)
M_r3 = gen_Matrix(-a, 0, 0)
Sdvig3 = gen_Matrix(0, T, 0)
M_r4 = gen_Matrix(-a, 0, 0)
Sdvig4 = gen_Matrix(0, T, 0)

SdvigL2 = gen_Matrix(0, l, 0) #движение по отрезку l2

# Расчет параметров движения на втором криволинейном участке
M_r5 = gen_Matrix(a, 0, 0)
Sdvig5 = gen_Matrix(0, T, 0)
M_r6 = gen_Matrix(a, 0, 0)
Sdvig6 = gen_Matrix(0, T, 0)
M_r7 = gen_Matrix(a, 0, 0)
Sdvig7 = gen_Matrix(0, T, 0)

SdvigL3 = gen_Matrix(0, l, 0) #движение по отрезку l3

# Решение прямой задачи кинематики путем последовательного перемножения матриц преобразования
REZ = Start*M_r1*SdvigL1*M_r2*Sdvig2*M_r3*Sdvig3*M_r4*Sdvig4*SdvigL2*M_r5*Sdvig5*M_r6*Sdvig6*M_r7*Sdvig7*SdvigL3

X = REZ[2]
Y = REZ[5]

X = round(X, 2)
Y = round(Y, 2)
# Вывод координат X и Y в консоль
print(f"Значения X, Y соответственно: {X, Y}")

