#Словарь это неупорядочненная колекция
lst = ["+7", "+6", "+5", "+4"]

a = dict.fromkeys(lst, "код") #Создание словарей из последовательности
#a.clear() #Удаляем все данные
#print(a)

d = {True: 1, False: "Покемон" , "list": [1, 2, 3], 5: 5}
d2 = d
"""С копией можем делать что угодно"""
d2 = d.copy()
d2["list"] = [0,0,0]
d.pop('list') #Удлаение ключа
d.popitem()#Удлание последнего ключа
d.setdefault(2, 'Двойка')
d.keys()#Возвращает список ключей
#print(d.get(False))
print(d)
#print(d2)
#print(id(d2))
#Получим значения словарей
for x in d.values():
    print(x)
#Возвращения списка из кортежей в формате (ключ значение)
for x in d.items():
    print(x)

#Обновление словаря
d = dict(one = '1', two =  '2', three = '3', four = '4')
print(d)

d2  = {2:'Неудовл.', 3:'удовл.', 'four': 'Хорошо', 5: 'Отлично'}