#Импортирование одного класса
#Перемещая класс в модуль и импортируя этот модуль, я получаю ту же функциональность,но
#основной файл программы при этом становится чистым и удобочитаемым.
#Когда классы работают так как положено, можно забыть о них и сосредоточиться на вы
#сокоуровневой логике прогаммы.
from study.import_practice.car import Car

my_new_car = Car('auidi', 'a4', 2024)
print(my_new_car.get_descriptive_name())

my_new_car.odometer_reading = 23#Устанавливаем значение по умолчанию для одометра
my_new_car.read_odometer()