import numpy as np
import matplotlib.pyplot as plt
from matplotlib.lines import Line2D

fig = plt.figure(figsize=(7, 4))
ax = fig.add_subplot()
line1, = ax.plot(np.arange(0, 5, 0.25), '--o',label='line 1')
line2, = ax.plot(np.arange(0, 10, 0.5),':s', label ='line 2')
# ax.legend((line2, line1 ),['Хрень 1','Хрень 2'],loc ='lower right')
ax.legend((line2, line1 ),['Хрень 1','Хрень 2'],bbox_to_anchor=(0.25,1))
ax.grid()
plt.show()
"""
--------------------------------------------------------------------------
Указываем список линий и меток при отображении информации в легенде
line1, = ax.plot(np.arange(0, 5, 0.25), '--o', label='line1')
line2, = ax.plot(np.arange(0, 10, 0.5), ':s', label='line2')
ax.legend((line2, line1), ['Линия 2', 'Линия 1'])
---------------------------------------------------------------------------------------------------------------------------------------------------------
с помощью параметра loc можно указывать расположение окна легенды в пределах координатных осей
['best', 'upper right', 'upper left', 'lower left', 'lower right', 'right', 'center left', 'center right', 'lower center', 'upper center', 'center']
ax.legend((line2, line1), ['Линия 2', 'Линия 1'], loc='upper right')
--------------------------------------------------------------------------------------------------------------------------------------------------------------
Если требуется более точное указание местоположения легенды, то можно воспользоваться параметром bbox_to_anchor и указать координаты информационного окна
ax.legend((line2, line1), ['Линия 2', 'Линия 1'], bbox_to_anchor=(0.5, 0.7))
-----------------------------------------------------------------------------------------------------------------------------------------------------------
Пакет matplotlib позволяет отображать формулы, записанные в формате TeX
ax.legend((line2, line1), [r'$f(x) = a \cdot b + c$', r'$f(x) = k \cdot x + b$'])
описание нужно заключить между символами $ и использовать режим записи r (row – «сырая» строка без экранирования символов)
--------------------------------------------------------------------------------------------------------------------------------------------------------------
fontsizeРазмер шрифта (число или строка: {'xxsmall', 'x-small', 'small', 'medium', 'large', 'x-large', 'xx-large'})
frameon Отображать ли рамку у легенды (True/False)
framealpha Прозрачность фона (вещественное число или None)
facecolor Цвет заливки
edgecolor Цвет рамки
title Текст заголовка, либо значение None
title_fontsize Размер шрифта для заголовка
"""

