#Словарь – это отображение множества ключей на множество значений
a = {
    'x': 1,
    'y': 2,
    'z':3
}

b = {
    'w': 10,
    'x': 11,
    'y': 2
}
c =a.keys()& b.keys()#Находим общие ключи
print(c)
print(a.keys() - b.keys() )# находим уникальный ключ
d = a.items() & b.items()#Находим общие пары
print(d)

dict = {key:a[key] for key in a.keys()-{'z','x'}} #Создание словаря из которого удалены некоторые ключи
print(dict)
"""Задача: исключить дублирующие значения из последовательности, но при этом сохранить порядок следования оставшихся элементов"""
def dedupe(items):
    seen = set() #Припысываем seen множество
    for item in items:
        if item not in seen:
            yield item# Генератор yield - используется для итерации
            seen.add(item)
            
a =[1,5,2,1,9,1,5,10]
print(list(dedupe(a)))