import numpy as np


# Ввод значений углов поворота:
x_angle = float(input("Введите угол поворота вокруг оси x в градусах: "))
y_angle = float(input("Введите угол поворота вокруг оси y в градусах: "))
z_angle = float(input("Введите угол поворота вокруг оси z в градусах: "))

#Ввод координат вектора смещения:
n = np.array([float(input("Введите координату смещения по оси x: ")),
              float(input("Введите координату смещения по оси y: ")),
              float(input("Введите координату смещения по оси z: "))])  # Вектор смещения
#Ввод коорднинат вектора r1
r1 = np.array([float(input("Введите координату x вектора r1: ")),
               float(input("Введите координату y вектора r1: ")),
               float(input("Введите координату z вектора r1: "))])  # Координаты вектора r1


# Преобразование углов поворота из градусов в радианы
x_angle_rad = np.radians(x_angle)
y_angle_rad = np.radians(y_angle)
z_angle_rad = np.radians(z_angle)

# Создание матрицы поворота
Rx = np.array([[1, 0, 0], [0, np.cos(x_angle_rad), -np.sin(x_angle_rad)], [0, np.sin(x_angle_rad), np.cos(x_angle_rad)]])  # поворот вокруг оси x

Ry = np.array([[np.cos(y_angle_rad), 0, np.sin(y_angle_rad)],[0, 1, 0], [-np.sin(y_angle_rad), 0, np.cos(y_angle_rad)]])  # поворот вокруг оси y

Rz = np.array([[np.cos(0), -np.sin(0), 0],[np.sin(0), np.cos(0), 0],[0, 0, 1]])  # поворот вокруг оси z

# Расчет матрицы поворота A
A = np.dot(Rx, np.dot(Ry, Rz))

# Векторно-матричное уравнение для определения координат центральной точки инструмента относительно механического интерфейса манипулятора
r2 = np.dot(A, r1 - n)
r1 = A*r2 +n

print("Координаты центральной точки инструмента относительно механического интерфейса манипулятора:", r2)



