import logging

logger = logging.getLogger('my_app')

def main():
    logging.basicConfig(level='Debug')
    logging.debug('Debug message')
    logging.warning('Warning message')
    logging.error('Error message')
    logging.critical('Critical message')
    try:
        1/0
    except ZeroDivisionError:
        logger.exception('Exception message')


if __name__ == "__main__":
    main()



"""
Debug (10): самый низкий уровень логирования, предназначенный для отладочных сообщений, для вывода диагностической информации о приложении.
Info (20): этот уровень предназначен для вывода данных о фрагментах кода, работающих так, как ожидается.
Warning (30): этот уровень логирования предусматривает вывод предупреждений, он применяется для записи сведений о событиях, на которые программист обычно обращает внимание. Такие события вполне могут привести к проблемам при работе приложения. Если явно не задать уровень логирования — по умолчанию используется именно warning.
Error (40): этот уровень логирования предусматривает вывод сведений об ошибках — о том, что часть приложения работает не так как ожидается, о том, что программа не смогла правильно выполниться.
Critical (50): этот уровень используется для вывода сведений об очень серьёзных ошибках, наличие которых угрожает нормальному функционированию всего приложения.

"""