import numpy as np
# a = np.array([1,2,3,10,20,30])
# b = np.array([2])
# print(a)
"""
Транслирование массивов
1. Если массивы имеют разное чило осей(размерностей), то к массиву с меньшим их числом добавляются новые так, чтобы
размерности совпадали.(Причем добавление происходит с Axis = 0).
2. Оси с одним элементом расширяются(по числу элементов) так, чтобы соответсвующие размерности двух массивов совпадали.
"""
# a = np.arange(1,10).reshape(3,3)
# # b = np.array([4,5,6])
# print(a+b)
# a = np.arange(6).reshape(3,1,2)
# b = np.ones(4).reshape(2,2)
# c = a*b
# print(c.shape)

"""
#a: 1x1x3
#b: 1x2x1
#c: 4x1x1
"""
# a.shape = 1,1,-1
# b.shape = 1,-1,1
# c.shape = -1,1,1
# c = a * b + c
# print(c.shape)
a = np.array([1,2,3])
b = np.array([4,5])
c = np.array([7,8,9,10])
an, bn, cn = np.ix_(a, b, c)#Только для одномерных массивов
"""
Данная функция создает новые оси, чтобы последующим действие суметь суммировать умножить и т.д
"""
print(cn.shape)
c = an * bn + cn
print(c)