import numpy as np
# a = np.array([1,2,3,10,20,30])
# a.sum()# Вычисляем сумму элементов
# a.mean() #Вычисляем среднее арифмитическое
# a.max() #Вычисляем максимальное значение
# a.min() #Вычисляем минимальное значение функции
# a.resize(3,2)
# print(a.sum(axis=0))
"""
np.abs(x) Вычисление модуля от аргумента(ов)x; x может быть числом, списком или массивом.
np.amax(x) Нахождение максимального значения от аргумента(ов)x
np.amin(x) Нахождение минимального значения от аргумента(ов)x
np.argmax(x) Нахождение индекса максимального значения дляx.
np.argmin(x) Нахождение индекса минимального значения дляx.
np.around(x) Округление до ближайшего целого.
np.mean(x) Вычисление среднего значения.
np.log(x) Вычисление натурального логарифма.
np.log2(x) Вычисление логарифма по основанию 2.
np.log10(x) Вычисление логарифма по основанию 10.
"""
"""
np.sin(x) Вычисление синуса угла x (в радианах); x может быть числом, списком, массивом (это правило распространяется на все функции этой таблицы).
np.cos(x) Вычисление косинуса угла(ов) x.
np.tan(x) Вычисление тангенса угла(ов) x.
np.arccos(x) Арккосинус угла(ов) x.
np.arcsin(x) Арксинус угла(ов) x.
np.arctan(x) Арктангенс угла(ов) x.
"""
# a = np.array([-1,1,5,-44,32,2])
# b = np.abs( a )#Вычисляем модуль
# c = np.abs([-10.5,-2,5])
# print(c)
# print(np.around(0.8))#Округление до целого числа
# print(np.argmax([a]))# Получим индекс, который имеет максимальное значение
# print(np.argmin(a))
# a.resize(2,3)
# print(a)
# print(np.amax(a,axis=0))
# print(np.log10(100))
# a = np.linspace(0,np.pi,10)# Равномерно распределяет числа за указанный интервал
# print(a)
# print(np.sin(a))
# print(np.cos([0, 1.57,3.14]))
"""
random.rand() Генерация чисел с равномерным законом распределения
np.random.randint() Генерация целых чисел с равномерным законом распределения
np.random.randn() Генерация нормальных случайных значений
np.random.seed() Установка начального состояния генератора
"""
# print(np.random.rand(10)) #Получаем разные значение от 0 до 1.
# print(np.random.randint(5,10))# Генерируем целые числа от 5 до 10.
# print(np.random.randint(1,10,size=(2,5)))#функция randint использвуется с равномерным распределением чисел!
# print(np.random.rand(2,3))
# print(np.random.beta(0.1,0.3,size=(3,3))) # Распределение по бэта стилю
# print(np.random.pareto(10,size=(5)))#Распределение по закону парэто
# print(np.random.seed(13))#Установка начального значения в скобках указываем до какого значения будут повторяться элементы.
# print(np.random.randint(10,size=10))
# np.random.seed(13)
# print(np.random.randint(10,size=10))
"""
Функции перемешивания элементов массива
np.randompermutation.shuffle()
p.random.()
"""
# a = np.arange(10)
# np.random.shuffle(a)#Перемешиваем массив только по оси axis 0.
# print(a)
# a = np.arange(1,10).reshape(3,3)
# np.random.shuffle(a)
# print(a)
# a = np.random.permutation(10)
# print(a)
"""
Функции математической статистики:
np.median(x) Вычисление медианы величин x
np.var(x) Дисперсия величин x
np.std(x) Среднеквадратическое отклонение величин x
np.corrcoef(x) Линейный коэффициент корреляции Пирсона
np.correlate(x) Вычисление кросс-корреляции
np.cov(x) Вычисление ковариационной матрицы
"""
x = np.array([1,4,3,7,10,8,14,21,20,23])
y = np.array([4,1,6,9,13,11,16,19,15,22])
# print(np.median(x))
# print(np.var(x))
xy = np.vstack([x,y])
print(xy)
print(np.cov(x))
