import numpy as np
"""
индексация, срезы и итерирование массивов
"""
# a = np.arange(12)
#
# a[0]= 100
# b = a[2:4]
"""
Срезы меняют представление самового массива
"""
# a[-5:-1]
# print(a)
# for x in a:
#     print(x,sep=' ',end=' ')

# x = np.array([(1,2,3),(10,20,30),(100,200,300)])
# print(x)
# print(x[:, 1])#Обращаемсяк столбцу
# print(x[0:2,0:2,1,1])

# a = np.arange(1,9)
# b = a[[0]]# ссылаемся на массив
# print(b)
# c =a[[0,1,7,5]]# создаем копию массива
# print(c)
# a[[0,1,7,5]] =  [10,20,30,40]
# print(a)
"""
b = a[[0,1,5]]- Возвращается новый массив 
с соотвевствующими элементами.
a[[0,1,7,5]]= [10,20,30,40] - Старому массиву
присваиваются новые элементы
"""
# indx = [0, 0, 1, 1, 1, 2]
"""
создаем копию массива с соответсвующими элементами
"""
# x = a[indx]
# print(x)
# p = np.array([0, 0, 1, 1, 1, 2])
# print(a[p])
# blIndx= [True,True,False,False,False,True,False,False,]
# print(a[blIndx])
# i = a > 5
# print(i)

# a = np.arange(1,9)
# i = np.array([[0,1], [2,3]])
# print(i)
# print(a[i])
# a = np.arange(1, 13).reshape(3,4)
"""
1234
5678
9101112
"""
indx =[2,1,0]
a = np.arange(7)
a[[0,0,0,1]]= [1,2,3,100]
print(a)

