import numpy as np
'''
bool	Булевы значения (True или False) хранятся в виде байтов
int	Тип по умолчанию — целое число (то же, что long в C; обычно int64 или int32)
intc	Идентичный int в C (обычно int32 или int64)
intp	Целое число для использования в качестве индексов (то же, что и size_t в C, обычно int32 или int64)
int8	Байт (от — 128 до 127)
int16	Целое число (от -32768 до 32767)
int32	Целое число (от -2147483648 до 2147483647)
int64	Целое число (от -9223372036854775808 до 9223372036854775807)
uint8	Целое число без знака (от 0 до 255)
uint16	Целое число без знака (от 0 до 65535)
uint32	Целое число без знака (от 0 до 4294967295)
uint64	Целое число без знака (от 0 до 18446744073709551615)
float	Обозначение float64
float16	Число с плавающей точкой половинной точности; бит на знак, 5-битная экспонента, 10-битная мантисса
float32	Число с плавающей точкой единичной точности; бит на знак, 8-битная экспонента, 23-битная мантисса
float64	Число с плавающей точкой двойной точности; бит на знак, 11-битная экспонента, 52-битная мантисса
complex	Обозначение complex128
complex64	Комплексное число, представленное двумя 32-битными float (с действительной и мнимой частями)
complex128	Комплексное число, представленное двумя 64-битными float (с действительной и мнимой частями)
'''
a = np.array([1,2,3,4])
print(a)
a = np.array([1,2,3,4],'float64')#Числа стали нецелочисленными а вещественными
print(a)
# print(np.sctypeDict) структура данных в numpy
# b = np.array([1,5,6,10,11,15],'str_')
# print(b)
# b = np.array([1,5,6,10,11,1000],dtype= 'int8') #1 байт не может хранить большие числа
# print(b)
b = np.array([1,5,6,10,11,1000])
print(np.complex64(b))
c = np.int32(b)#Преобразования к целому числу, возможны потери данных!
print(c)
# a = np.array([[1,2],[3,4],[5,6]])# Создание двухмерного массива с двумя столбцами.
# print(a)


b = np.array([[[1, 2], [3, 4]], [[5, 6], [7, 8]], [[9, 10], [11, 12]]]) # Создание трёхмерного массива
print(b[1,0,0])

с = np.fromiter('Hello',dtype='u1')
prrint(c)