import numpy as np
lst = [1, 2, 3]
# a = np.array([1,2,3])
# b = a*2
# print(b)
"""
Базовые операции над numpy
+ Сложение массивов или массива с числом

- Вычитание массивов или массива с числом, либо используется как унарный минус

* Умножение массивов или массива с числом

/ - Деление массивов или массива с числом

//- Целочисленное деление массивов или массива с числом

** - Возведение в степень (указывается или число или массив)
%- Вычисления остатка от деления (указывается или число или массив)
"""

# print(a-3)
# print(a+2)
# print(a**4)
# b = np.array([3,4,5])
# print(a*b)
# b = np.arange(1,7)
# b.resize(2,3)
# print(a+b)
# a = np.arange(1,19)
# a.resize(3,3,2)
# b = np.ones((3,2))
# print(a-b)
a = np.array([1,2,6,8])
"""
При выполнении арифметических операций тип данных 
автоматически приводится к более общему.
"""
a+=5
b = np.ones(4)
b*=a
print(b)
(a+b)*5 - 10
