#Произведение матриц и векторов, элементы линейной алгебры
import numpy as np
# a = np.arange(0,4).reshape(3,3)
# b = np.arange(4,7).reshape(3,3)
# print(np.dot(a,b))
"""
np.dot(a, b) - Перемножение матриц по правилам математики
"""
# np.matmul(b,a)
# a = np.arange(1,10)
# b = np.ones(9)
# print(np.dot(a,b))
"""
Для использования векторного умножения можно использовать 
np.dot(x,y)
np.inner(x,y)
Для использования внешнего умножения используем  функцию 
np.outer
Оператор @ делает внутреннее умножение
"""
# a.resize(3, 3)
# b.resize(3, 3)
# print(a @ b)
a = np.array([(1,2,3),(1,4,9),(1,8,27)])
"""
1x1+2x2+3x3=y1
1x1+4x2+9x3=y2
1x1+8x2+27x3=y3
"""
# print(a)
"""
np.linalg.matrix_rank(a)- вычисление ранга матрицы,чтобы
проверить что она состоит из линейно независимых строк и столбцов
чтобы вычислить корни уравнения пользуемся np.linalg.solve(a)
"""
np.linalg.matrix_rank(a)# Проверяем что матрица состоит из линейно независимых строк и столбцов
y = np.array([10,20,30])
# print(np.linalg.solve(a,y))
invA = np.linalg.inv(a)#Обратная матрица к матрице a
print(invA @ y)
print(np.linalg.det(invA))
b = np.expand_dims(y,axis=0)
f = np.append(b,40)
print(f)

"""
linalg.cholesky() Разложение Холецкого
linalg.qr() QR-разложение матрицы
linalg.svd() Сингулярное (SVD) разложение матрицы
linalg.norm() Норма матрицы или вектора
linalg.cond() Число обусловленности матрицы
linalg.det() Определитель (детерминант) матрицы
linalg.matrix_rank() Вычисление ранга матрицы по алгоритму SVD

np.trace() Сумма диагональных элементов массива
linalg.eig() Вычисление собственных значений и правых собственных векторов
linalg.eigvals() Вычисление собственных значений матрицы
linalg.solve() Решение линейного матричного уравнения
linalg.tensorsolve() Решение линейного тензорного уравнения
linalg.lstsq() Решает задачу поиска наименьших квадратов для линейного матричного уравнения
linalg.inv() Вычисление обратной матрицы
linalg.pinv() Вычисление псевдообратной (Мура-Пенроуза) матрицы
linalg.tensorinv() Вычисление обратного тензора (N-мерного массива)
"""