import numpy as np
'''
empty(shape, …) Возвращает новый массив заданного размера и типа данных, но без определенных значений.

eye(N, M=None, …) Возвращает массив размером NxMс единичными диагональными элементами (остальные элементы равны нулю).

identity(n, …) Возвращает квадратный массив размерностью nxn с единичными элементами по главной диагонали (остальные равны нулю).

ones(shape, …) Возвращает массив заданного размера и типа, состоящего из всех единиц.

zeros(shape, …) Возвращает массив заданного размера и типа, состоящего из всех нулей.

full(shape, value, …) Возвращает массив заданного размера и типа со значениями value.
'''



# a = np.array([[[1,2]],[[3,4]],[[5,6]],[[7,8]]])
# print(a[0,0,1])
# np.array([x for x in range(10)])
# array([0, 1, 2, 3, 4, 5, 6, 7, 8, 9])

# c = np.empty(10, dtype='int16')
# print(c)
# d = np.eye(4,2)
# # print(d)
# a = np.identity(5*5)
# print(a)
# d = np.zeros((2,3,4))
# a = np.ones([4,3],dtype='int8')
# print(a)
# b = np.full((3,2),-1)
# print(b)

"""
mat(object, …) Приводит входные данные object к матрице, если это возможно. Параметр object может быть строкой, списком или кортежем.

diag(list, …) Формирует диагональную матрицу на основе списка или массива NumPy. В последних версиях возвращает копию массива (а не его представление).

diagflat(list, …) Формирует диагональную матрицу из списка list, который сначала сжимает до одной оси (преобразует в одномерный список или массив).

tri(N, M=None, …) Создает треугольный массив NxM с единицами на главной диагонали и ниже ее.

tril(list, …) Преобразует двумерный список или массив list в треугольную матрицу с нулевыми элементами выше главной диагонали.

triu(list, …) Преобразует двумерный список или массив list в треугольную матрицу с нулевыми элементами ниже главной диагонали.

vander(list, N=None, …) Создание матрицы Вандермонда из одномерного списка или массива list. Второй параметр N определяет число столбцов (по умолчанию формируется квадратная матрица
"""
# a = np.mat('12; 34')
# print(a)
a = np.array([(1,2,3),(4,5,6),(7,8,9)])
# print(b)
# c = np.tri(4)
# print(c)
# print(np.triu(a))
# b = np.vander([1,2,3])

"""
arange() Возвращает одномерный массив с равномерно разнесенными числами указанного диапазона.

linspace(start, stop, …) Возвращает одномерный массивc равномерно разнесенными числами, используя только значения начала и конца интервала.

logspace(start, stop, …) Возвращает одномерный массив с числами, равномерно распределенных по логарифмической шкале.

geomspace(start, stop, …) Формирование чисел по геометрической прогрессии.

meshgrid(x1, ..., xn, …) x1, ..., xn – одномерные последовательности или массивы, используемые для формирования координатной сетки по каждой из осей.

mgrid[] Возвращает массив плотных координатных сеток.

ogrid[] Возвращает открытую сетку значений.
"""
# b = np.arange(0, np.pi, 0.1)
# print(b)
# c = np.cos(np.arange(0,np.pi,0.1))
# print(c)
# a = np.linspace(0,2,)
# print(a)
# b = np.logspace(0,1,4) # логарифмический масштаб
# print(b)
c = np.geomspace(1,4,3)# формирование чисел по геометрической прогрессии
# print(c)
# d = np.geomspace(1,16,5)
# print(d)
"""
array(object, …) Преобразует список или кортеж object в массив NumPy.

asanyarray(list, …) Преобразует список list в массив array, сохраняя тип подкласса.

ascontiguousarray(list, …) Возвращает непрерывный массив в памяти, подобно как это организовано в языке C.

asmatrix(list, …) Преобразует входную последовательность list в матрицу NumPy (тип matrix).

copy(list, …) Возвращает копию массива list (если это объект NumPy) или просто создает массив на основе списка языка Python.

frombuffer(buffer, …) Преобразует данные из буфера в массив NumPy

fromfile(file, …) Возвращает массив из данных текстового или бинарного файла file.

fromfunction(func, shape, …) Создает массивразмерностью shape с помощью функции func.

fromiter(iter, …) Создает массив на основе итерируемого объекта.

fromstring(string, …) Создает массив из данных строки.

loadtxt(file, …) Формирует массив из данных текстового файла.
"""
# a = np.array([(1,2),(3,4)])
# b = np.copy(a)
# b[0] = 100
# print(b)
def getRange(x,y):
    return 100*x +y
# a = np.fromfunction(getRange,(2,2)) #fromfunction(func, shape, …) Создает массивразмерностью shape с помощью функции func.
# print(a)

# b = np.fromfunction(lambda x, y: x*100+y,(2,2))
# # print(b)
# f = np.fromiter('Hello', dtype='U1')
# print(f)

# def getRange(a):
#     for i in range(a):
        # yield i #Yield это ключевое слово, которое используется примерно как return — отличие в том, что функция вернёт генератор.
# a = np.fromiter(getRange(4),dtype='int8')# Формирование Массива на основе функции
# print(a)


# a = np.array([0.1,0.2,0.3,0.4,0.5,0.6,0.7,0.8,0.9])
# # a.dtype = np.int8() # Число элементов увеличелось в 8 раз, int8 преобразование в однобайтное представление целого числа
# a.dtype = 'float32'
# print(a)
# print(a.size)
# print(a.itemsize) # Сколько байт занимает 1 элемент в массиве
# print(a.size*a.itemsize)
b = np.ones((3,4,5))
print(b)
b.npdim




